vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXC243_DFP.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MCXC243_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MCXC243</description>
  <url>https://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="25.09.00" date="2025-09-19">NXP CMSIS Packs based on MCUXpresso SDK 25.09.00</release>
    <release version="25.06.01" date="2025-07-01">
      NXP CMSIS Packs based on MCUXpresso SDK 25.06.00 with flashloader display name updated
    </release>
    <release version="25.06.00" date="2025-06-24">NXP CMSIS Packs based on MCUXpresso SDK 25.06.00</release>
    <release version="25.03.00" date="2025-03-28">NXP CMSIS Packs based on MCUXpresso SDK 25.03.00</release>
    <release version="19.0.0" date="2024-07-17">NXP CMSIS Packs based on MCUXpresso SDK 2.16.0</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <requirements>
    <packages>
      <package name="CMSIS" vendor="ARM" version="6.1.0"/>
    </packages>
    <languages>
      <language name="C" version="99"/>
    </languages>
  </requirements>
  <devices>
    <family Dfamily="MCXC243" Dvendor="NXP:11">
      <description>
        The MCXC243 is a general purpose ultra-low-power MCU family, providing additional memory, communications and analog peripheral.
      </description>
      <device Dname="MCXC243">
        <processor Dcore="Cortex-M0+" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="48000000"/>
        <environment name="iar">
          <file category="linkerfile" name="devices/MCXC243/iar/MCXC243_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x020000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x1ffff000" size="0x4000" access="rw" default="1"/>
        <algorithm name="devices/MCXC243/arm/MK_P128_48MHZ_MCXC444.FLM" start="0x00000000" size="0x00020000" RAMstart="0x1ffff000" RAMsize="0x00000800" default="1"/>
        <debug svd="devices/MCXC243/MCXC243.xml"/>
        <variant Dvariant="MCXC243VFT">
          <compile header="devices/MCXC243/fsl_device_registers.h" define="CPU_MCXC243VFT"/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="device.MCXC243.internal_condition">
      <accept Dname="MCXC243VFT" Dvendor="NXP:11"/>
    </condition>
    <condition id="cmake_toolchain.condition_id">
      <require condition="allOf.device=MCXC243.internal_condition"/>
    </condition>
    <condition id="allOf.device=MCXC243.internal_condition">
      <require condition="device.MCXC243.internal_condition"/>
    </condition>
    <condition id="component.Legacy_flash_adapter.condition_id">
      <require condition="allOf.driver.flash, device=MCXC243.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flash, device=MCXC243.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flash"/>
      <require condition="device.MCXC243.internal_condition"/>
    </condition>
    <condition id="component.ak4497_adapter.condition_id">
      <require condition="allOf.device=MCXC243.internal_condition"/>
    </condition>
    <condition id="component.at_least_one_i2c_mux_device_enabled.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MCXC243.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_mux_pca954x, device=MCXC243.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_mux_pca954x"/>
      <require condition="device.MCXC243.internal_condition"/>
    </condition>
    <condition id="component.audio_sai_dma_adapter.condition_id">
      <require condition="allOf.driver.sai_dma, device=MCXC243.internal_condition"/>
    </condition>
    <condition id="allOf.driver.sai_dma, device=MCXC243.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sai_dma"/>
      <require condition="device.MCXC243.internal_condition"/>
    </condition>
    <condition id="component.button.condition_id">
      <require condition="allOf.anyOf=allOf=component.gpio_adapter, driver.gpio, component.timer_manager, device=MCXC243.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.gpio_adapter, driver.gpio, component.timer_manager, device=MCXC243.internal_condition">
      <require condition="anyOf.allOf=component.gpio_adapter, driver.gpio.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require condition="device.MCXC243.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.gpio_adapter, driver.gpio.internal_condition">
      <accept condition="allOf.component.gpio_adapter, driver.gpio.internal_condition"/>
    </condition>
    <condition id="allOf.component.gpio_adapter, driver.gpio.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
    </condition>
    <condition id="component.cmsis_drivers.condition_id">
      <require condition="allOf.device=MCXC243.internal_condition"/>
    </condition>
    <condition id="component.codec_adapters.condition_id">
      <require condition="allOf.device=MCXC243.internal_condition"/>
    </condition>
    <condition id="component.codec_i2c.condition_id">
      <require condition="allOf.component.i2c_adapter_interface, device=MCXC243.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_adapter_interface, device=MCXC243.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter_interface"/>
      <require condition="device.MCXC243.internal_condition"/>
    </condition>
    <condition id="component.cs42448_adapter.condition_id">
      <require condition="allOf.device=MCXC243.internal_condition"/>
    </condition>
