vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXC243_DFP.pdsc
    <condition id="allOf.component.lpuart_adapter, device=MCXC243.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require condition="device.MCXC243.internal_condition"/>
    </condition>
    <condition id="component.serial_manager_virtual.condition_id">
      <require condition="allOf.device=MCXC243.internal_condition"/>
    </condition>
    <condition id="component.sgtl_adapter.condition_id">
      <require condition="allOf.device=MCXC243.internal_condition"/>
    </condition>
    <condition id="component.software_crc_adapter.condition_id">
      <require condition="allOf.device=MCXC243.internal_condition"/>
    </condition>
    <condition id="component.software_rng_adapter.condition_id">
      <require condition="allOf.component.rng_adapter_interface, device=MCXC243.internal_condition"/>
    </condition>
    <condition id="allOf.component.rng_adapter_interface, device=MCXC243.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rng_adapter_interface"/>
      <require condition="device.MCXC243.internal_condition"/>
    </condition>
    <condition id="component.spi_adapter.condition_id">
      <require condition="allOf.driver.common, driver.spi, device=MCXC243.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.spi, device=MCXC243.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require condition="device.MCXC243.internal_condition"/>
    </condition>
    <condition id="component.tfa9896_adapter.condition_id">
      <require condition="allOf.device=MCXC243.internal_condition"/>
    </condition>
    <condition id="component.tfa9xxx_adapter.condition_id">
      <require condition="allOf.device=MCXC243.internal_condition"/>
    </condition>
    <condition id="component.timer_manager.condition_id">
      <require condition="allOf.anyOf=allOf=component.lptmr_adapter, driver.lptmr, allOf=component.pit_adapter, driver.pit, allOf=component.tpm_adapter, driver.tpm, component.lists, driver.common, device=MCXC243.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.lptmr_adapter, driver.lptmr, allOf=component.pit_adapter, driver.pit, allOf=component.tpm_adapter, driver.tpm, component.lists, driver.common, device=MCXC243.internal_condition">
      <require condition="anyOf.allOf=component.lptmr_adapter, driver.lptmr, allOf=component.pit_adapter, driver.pit, allOf=component.tpm_adapter, driver.tpm.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXC243.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.lptmr_adapter, driver.lptmr, allOf=component.pit_adapter, driver.pit, allOf=component.tpm_adapter, driver.tpm.internal_condition">
      <accept condition="allOf.component.lptmr_adapter, driver.lptmr.internal_condition"/>
      <accept condition="allOf.component.pit_adapter, driver.pit.internal_condition"/>
      <accept condition="allOf.component.tpm_adapter, driver.tpm.internal_condition"/>
    </condition>
    <condition id="allOf.component.lptmr_adapter, driver.lptmr.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr"/>
    </condition>
    <condition id="allOf.component.pit_adapter, driver.pit.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pit_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pit"/>
    </condition>
    <condition id="allOf.component.tpm_adapter, driver.tpm.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tpm_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tpm"/>
    </condition>
    <condition id="component.tpm_adapter.condition_id">
      <require condition="allOf.driver.tpm, device=MCXC243.internal_condition"/>
    </condition>
    <condition id="component.uart_adapter.condition_id">
      <require condition="allOf.driver.uart, device=MCXC243.internal_condition"/>
    </condition>
    <condition id="allOf.driver.uart, device=MCXC243.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require condition="device.MCXC243.internal_condition"/>
    </condition>
    <condition id="component.wm8524_adapter.condition_id">
      <require condition="allOf.device=MCXC243.internal_condition"/>
    </condition>
    <condition id="component.wm8904_adapter.condition_id">
      <require condition="allOf.device=MCXC243.internal_condition"/>
    </condition>
    <condition id="component.wm8960_adapter.condition_id">
      <require condition="allOf.device=MCXC243.internal_condition"/>
    </condition>
    <condition id="component.wm8962_adapter.condition_id">
      <require condition="allOf.device=MCXC243.internal_condition"/>
    </condition>
    <condition id="device.CMSIS.condition_id">
      <require condition="allOf.CMSIS_Include_core_cm, device=MCXC243.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Include_core_cm, device=MCXC243.internal_condition">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="device.MCXC243.internal_condition"/>
    </condition>
    <condition id="device_id.MCXC243.internal_condition">
      <accept Dname="MCXC243VFT" Dvendor="NXP:11"/>
    </condition>
    <condition id="device.RTE.condition_id">
      <require condition="allOf.device_id=MCXC243, driver.dma, driver.dmamux.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MCXC243, driver.dma, driver.dmamux.internal_condition">
      <require condition="device_id.MCXC243.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
    </condition>
    <condition id="device.linker.condition_id">
      <require condition="allOf.device_id=MCXC243.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MCXC243.internal_condition">
      <require condition="device_id.MCXC243.internal_condition"/>
    </condition>
    <condition id="device_ids.MCXC243.internal_condition">
      <accept Dname="MCXC243VFT" Dvendor="NXP:11"/>
    </condition>
    <condition id="allOf.toolchains=mdk, device_ids=MCXC243.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="device_ids.MCXC243.internal_condition"/>
    </condition>
    <condition id="toolchains.mdk.internal_condition">
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, device_ids=MCXC243.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="device_ids.MCXC243.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc.internal_condition">
      <accept Tcompiler="GCC"/>
    </condition>
    <condition id="allOf.toolchains=iar, device_ids=MCXC243.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="device_ids.MCXC243.internal_condition"/>
    </condition>
    <condition id="toolchains.iar.internal_condition">
      <accept Tcompiler="IAR"/>
    </condition>
    <condition id="device.project_template.condition_id">
      <require condition="allOf.component.lpuart_adapter, device_id=MCXC243, device.startup, driver.clock, driver.common, driver.gpio, driver.lpuart, driver.port, driver.smc, anyOf=allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpuart_adapter, device_id=MCXC243, device.startup, driver.clock, driver.common, driver.gpio, driver.lpuart, driver.port, driver.smc, anyOf=allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require condition="device_id.MCXC243.internal_condition"/>
      <require Cclass="Device" Cgroup="Startup" Csub=""/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="port"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smc"/>
      <require condition="anyOf.allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition">
      <accept condition="allOf.component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config.internal_condition"/>
      <accept condition="allOf.utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
    <condition id="allOf.component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug console template config"/>
    </condition>
    <condition id="allOf.utility.assert_lite, utility.debug_console_lite.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
    </condition>
