vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXC243_DFP.pdsc
    <condition id="driver.cs42888.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.cs42888_adapter, driver.codec, device=MCXC243.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.cs42888_adapter, driver.codec, device=MCXC243.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXC243.internal_condition"/>
    </condition>
    <condition id="driver.dac.condition_id">
      <require condition="allOf.driver.common, device_id=MCXC243.internal_condition"/>
    </condition>
    <condition id="driver.dialog7212.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.da7212_adapter, driver.codec, device=MCXC243.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.da7212_adapter, driver.codec, device=MCXC243.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="da7212_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXC243.internal_condition"/>
    </condition>
    <condition id="driver.dma.condition_id">
      <require condition="allOf.driver.common, driver.dmamux, device_id=MCXC243.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.dmamux, device_id=MCXC243.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require condition="device_id.MCXC243.internal_condition"/>
    </condition>
    <condition id="driver.dmamux.condition_id">
      <require condition="allOf.driver.common, device_id=MCXC243.internal_condition"/>
    </condition>
    <condition id="driver.ektf2k.condition_id">
      <require condition="allOf.device=MCXC243.internal_condition"/>
    </condition>
    <condition id="driver.flash.condition_id">
      <require condition="allOf.driver.common, device_id=MCXC243.internal_condition"/>
    </condition>
    <condition id="driver.flexio.condition_id">
      <require condition="allOf.driver.common, device_id=MCXC243.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2c_master.condition_id">
      <require condition="allOf.driver.flexio, device_id=MCXC243.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexio, device_id=MCXC243.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio"/>
      <require condition="device_id.MCXC243.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2s.condition_id">
      <require condition="allOf.driver.flexio, device_id=MCXC243.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2s_dma.condition_id">
      <require condition="allOf.driver.dma, device=MCXC243.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dma, device=MCXC243.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require condition="device.MCXC243.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi.condition_id">
      <require condition="allOf.driver.flexio, device_id=MCXC243.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi_dma.condition_id">
      <require condition="allOf.driver.dma, device=MCXC243.internal_condition"/>
    </condition>
    <condition id="driver.flexio_uart.condition_id">
      <require condition="allOf.driver.flexio, device_id=MCXC243.internal_condition"/>
    </condition>
    <condition id="driver.flexio_uart_dma.condition_id">
      <require condition="allOf.driver.dma, device=MCXC243.internal_condition"/>
    </condition>
    <condition id="driver.ft3267.condition_id">
      <require condition="allOf.device=MCXC243.internal_condition"/>
    </condition>
    <condition id="driver.ft5406.condition_id">
      <require condition="allOf.device=MCXC243.internal_condition"/>
    </condition>
    <condition id="driver.ft6x06.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, device=MCXC243.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, device=MCXC243.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require condition="device.MCXC243.internal_condition"/>
    </condition>
    <condition id="driver.fxas21002cq.condition_id">
      <require condition="allOf.anyOf=driver.i2c, driver.common, device=MCXC243.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.i2c, driver.common, device=MCXC243.internal_condition">
      <require condition="anyOf.driver.i2c.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXC243.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.i2c.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
    <condition id="driver.fxls8974cf.condition_id">
      <require condition="allOf.anyOf=driver.i2c, driver.common, device=MCXC243.internal_condition"/>
    </condition>
    <condition id="driver.fxos8700cq.condition_id">
      <require condition="allOf.anyOf=driver.i2c, driver.common, device=MCXC243.internal_condition"/>
    </condition>
    <condition id="driver.gpio.condition_id">
      <require condition="allOf.driver.common, device_id=MCXC243.internal_condition"/>
    </condition>
