vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXC243_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rng_adapter_interface" Cversion="1.0.0" condition="component.rng_adapter_interface.condition_id">
      <description>Component rng_adapter_interface</description>
      <files>
        <file category="header" name="components/rng/fsl_adapter_rng.h" projectpath="component/rng"/>
        <file category="include" name="components/rng/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rnga_adapter" Cversion="1.0.0" condition="component.rnga_adapter.condition_id">
      <description>Component rnga_adapter</description>
      <files>
        <file category="sourceC" name="components/rng/fsl_adapter_rnga.c" projectpath="component/rng"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="component_rtc" Cversion="1.0.0" condition="component.rtc_adapter.condition_id">
      <description>Component rtc</description>
      <RTE_Components_h>
        #ifndef RTC_LEGACY_FUNCTION_PROTOTYPE
        #define RTC_LEGACY_FUNCTION_PROTOTYPE 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/rtc/fsl_adapter_rtc.h" projectpath="component/rtc"/>
        <file category="sourceC" name="components/rtc/fsl_adapter_rtc.c" projectpath="component/rtc"/>
        <file category="include" name="components/rtc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager" Cversion="1.0.1" condition="component.serial_manager.condition_id">
      <description>Component serial_manager</description>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_manager.h" projectpath="component/serial_manager"/>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_internal.h" projectpath="component/serial_manager"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_manager.c" projectpath="component/serial_manager"/>
        <file category="include" name="components/serial_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_spi" Cversion="1.0.0" condition="component.serial_manager_spi.condition_id">
      <description>Component serial_manager_spi</description>
      <RTE_Components_h>
        #ifndef SERIAL_PORT_TYPE_SPI
        #define SERIAL_PORT_TYPE_SPI 1
        #endif
        #ifndef SERIAL_PORT_TYPE_SPI_MASTER
        #define SERIAL_PORT_TYPE_SPI_MASTER 1
        #endif
        #ifndef SERIAL_PORT_TYPE_SPI_SLAVE
        #define SERIAL_PORT_TYPE_SPI_SLAVE 1
        #endif
        #ifndef SERIAL_MANAGER_NON_BLOCKING_MODE
        #define SERIAL_MANAGER_NON_BLOCKING_MODE 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_spi.h" projectpath="component/serial_manager"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_spi.c" projectpath="component/serial_manager"/>
        <file category="include" name="components/serial_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo" Cversion="1.0.0" condition="component.serial_manager_swo.condition_id">
      <description>Component serial_manager_swo</description>
      <RTE_Components_h>
#ifndef SERIAL_PORT_TYPE_SWO
#define SERIAL_PORT_TYPE_SWO 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_swo.h" projectpath="component/serial_manager"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_swo.c" projectpath="component/serial_manager"/>
        <file category="include" name="components/serial_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart" Cversion="1.0.0" condition="component.serial_manager_uart.condition_id">
      <description>Component serial_manager_uart</description>
      <RTE_Components_h>
#ifndef SERIAL_PORT_TYPE_UART
#define SERIAL_PORT_TYPE_UART 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_uart.h" projectpath="component/serial_manager"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_uart.c" projectpath="component/serial_manager"/>
        <file category="include" name="components/serial_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual" Cversion="1.0.0" condition="component.serial_manager_virtual.condition_id">
      <description>Component serial_manager_virtual</description>
      <RTE_Components_h>
        #ifndef SSERIAL_PORT_TYPE_VIRTUAL
        #define SSERIAL_PORT_TYPE_VIRTUAL 1
        #endif
        #ifndef DEBUG_CONSOLE_TRANSFER_NON_BLOCKING
        #define DEBUG_CONSOLE_TRANSFER_NON_BLOCKING 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_virtual.h" projectpath="component/serial_manager"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_virtual.c" projectpath="component/serial_manager"/>
        <file category="include" name="components/serial_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl_adapter" Cversion="2.2.0" condition="component.sgtl_adapter.condition_id">
      <description>Component sgtl5000 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/sgtl5000/fsl_codec_sgtl_adapter.h" projectpath="codec/port/sgtl5000"/>
        <file category="sourceC" name="components/codec/port/sgtl5000/fsl_codec_sgtl_adapter.c" projectpath="codec/port/sgtl5000"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/sgtl5000/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="software_crc_adapter" Cversion="1.0.0" condition="component.software_crc_adapter.condition_id">
      <description>Component software_crc_adapter</description>
      <files>
        <file category="header" name="components/crc/fsl_adapter_crc.h" projectpath="component/crc"/>
        <file category="sourceC" name="components/crc/fsl_adapter_software_crc.c" projectpath="component/crc"/>
        <file category="include" name="components/crc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="software_rng_adapter" Cversion="1.0.0" condition="component.software_rng_adapter.condition_id">
      <description>Component software_rng_adapter</description>
      <files>
        <file category="sourceC" name="components/rng/fsl_adapter_software_rng.c" projectpath="component/rng"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spi_adapter" Cversion="1.0.0" condition="component.spi_adapter.condition_id">
      <description>Component spi_adapter</description>
      <files>
        <file category="header" name="components/spi/fsl_adapter_spi.h" projectpath="component/spi"/>
        <file category="sourceC" name="components/spi/fsl_adapter_spi.c" projectpath="component/spi"/>
        <file category="include" name="components/spi/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9896_adapter" Cversion="2.2.0" condition="component.tfa9896_adapter.condition_id">
      <description>Component tfa9896 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/tfa9896/fsl_codec_tfa9896_adapter.h" projectpath="codec/port/tfa9896"/>
        <file category="sourceC" name="components/codec/port/tfa9896/fsl_codec_tfa9896_adapter.c" projectpath="codec/port/tfa9896"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/tfa9896/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9xxx_adapter" Cversion="2.2.0" condition="component.tfa9xxx_adapter.condition_id">
      <description>Component tfa9xxx adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/tfa9xxx/fsl_codec_tfa9xxx_adapter.h" projectpath="codec/port/tfa9xxx"/>
        <file category="sourceC" name="components/codec/port/tfa9xxx/fsl_codec_tfa9xxx_adapter.c" projectpath="codec/port/tfa9xxx"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/tfa9xxx/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager" Cversion="1.0.0" condition="component.timer_manager.condition_id">
      <description>Component timer_manager</description>
      <files>
        <file category="header" name="components/timer_manager/fsl_component_timer_manager.h" projectpath="component/timer_manager"/>
        <file category="sourceC" name="components/timer_manager/fsl_component_timer_manager.c" projectpath="component/timer_manager"/>
        <file category="include" name="components/timer_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tpm_adapter" Cversion="1.0.0" condition="component.tpm_adapter.condition_id">
      <description>Component tpm_adapter</description>
      <RTE_Components_h>
#ifndef TIMER_PORT_TYPE_TPM
#define TIMER_PORT_TYPE_TPM 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/timer/fsl_adapter_timer.h" projectpath="component/timer"/>
        <file category="sourceC" name="components/timer/fsl_adapter_tpm.c" projectpath="component/timer"/>
        <file category="include" name="components/timer/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="uart_adapter" Cversion="1.0.0" condition="component.uart_adapter.condition_id">
      <description>Component uart_adapter</description>
      <files>
        <file category="header" name="components/uart/fsl_adapter_uart.h" projectpath="component/uart"/>
        <file category="sourceC" name="components/uart/fsl_adapter_uart.c" projectpath="component/uart"/>
        <file category="include" name="components/uart/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8524_adapter" Cversion="2.2.0" condition="component.wm8524_adapter.condition_id">
      <description>Component wm8524 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.h" projectpath="codec/port/wm8524"/>
        <file category="sourceC" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.c" projectpath="codec/port/wm8524"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8524/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter" Cversion="2.2.0" condition="component.wm8904_adapter.condition_id">
      <description>Component wm8904 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.h" projectpath="codec/port/wm8904"/>
        <file category="sourceC" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.c" projectpath="codec/port/wm8904"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8904/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter" Cversion="2.2.0" condition="component.wm8960_adapter.condition_id">
      <description>Component wm8960 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.h" projectpath="codec/port/wm8960"/>
        <file category="sourceC" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.c" projectpath="codec/port/wm8960"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8960/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962_adapter" Cversion="2.2.0" condition="component.wm8962_adapter.condition_id">
      <description>Component wm8962 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.h" projectpath="codec/port/wm8962"/>
        <file category="sourceC" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.c" projectpath="codec/port/wm8962"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8962/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXC243_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MCXC243_cmsis</description>
      <files>
        <file category="header" name="devices/MCXC243/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MCXC243/MCXC243.h" projectpath="device"/>
        <file category="header" name="devices/MCXC243/MCXC243_features.h" projectpath="device"/>
        <file category="header" name="devices/MCXC243/MCXC243_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_ADC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_CMP.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_DAC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_DMA.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_DMAMUX.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_FGPIO.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_FLEXIO.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_FTFA.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_GPIO.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_I2C.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_I2S.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_LCD.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_LLWU.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_LPTMR.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_LPUART.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_MCG.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_MCM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_MTB.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_MTBDWT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_NV.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_OSC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_PIT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_PMC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_PORT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_RCM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_RFSYS.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_ROM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_RTC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_SIM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_SMC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_SPI.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_TPM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_UART.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_USB.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC243/periph2/PERI_VREF.h" projectpath="device/periph2"/>
        <file category="include" name="devices/MCXC243/"/>
        <file category="include" name="devices/MCXC243/periph2/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MCXC243/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXC243/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MCXC243_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MCXC243_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MCXC243.condition_id" category="linkerScript" attr="config" name="devices/MCXC243/arm/MCXC243_flash.scf" version="1.0.0" projectpath="MCXC243/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MCXC243.condition_id" category="linkerScript" attr="config" name="devices/MCXC243/arm/MCXC243_ram.scf" version="1.0.0" projectpath="MCXC243/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXC243.condition_id" category="linkerScript" attr="config" name="devices/MCXC243/gcc/MCXC243_flash.ld" version="1.0.0" projectpath="MCXC243/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXC243.condition_id" category="linkerScript" attr="config" name="devices/MCXC243/gcc/MCXC243_ram.ld" version="1.0.0" projectpath="MCXC243/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXC243.condition_id" category="linkerScript" attr="config" name="devices/MCXC243/iar/MCXC243_flash.icf" version="1.0.0" projectpath="MCXC243/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXC243.condition_id" category="linkerScript" attr="config" name="devices/MCXC243/iar/MCXC243_ram.icf" version="1.0.0" projectpath="MCXC243/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MCXC243" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MCXC243</description>
      <files>
        <file category="header" attr="config" name="devices/MCXC243/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXC243/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXC243/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXC243/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXC243/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXC243/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXC243/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXC243/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXC243/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MCXC243_startup</description>
      <files>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceAsm" attr="config" name="devices/MCXC243/iar/startup_MCXC243.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceAsm" attr="config" name="devices/MCXC243/gcc/startup_MCXC243.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceAsm" attr="config" name="devices/MCXC243/arm/startup_MCXC243.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXC243_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MCXC243_system</description>
      <files>
        <file category="sourceC" name="devices/MCXC243/system_MCXC243.c" projectpath="device"/>
        <file category="header" name="devices/MCXC243/system_MCXC243.h" projectpath="device"/>
        <file category="include" name="devices/MCXC243/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc" Cversion="2.3.0" condition="driver.adc16.condition_id">
      <description>ADC16 Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXC243/drivers/fsl_adc16.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXC243/drivers/fsl_adc16.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXC243/drivers/"/>
      </files>
    </component>
