vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXC243_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497" Cversion="2.1.2" condition="driver.ak4497.condition_id">
      <description>Driver ak4497</description>
      <RTE_Components_h>
#ifndef CODEC_AK4497_ENABLE
#define CODEC_AK4497_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/ak4497/fsl_ak4497.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/ak4497/fsl_ak4497.c" projectpath="codec"/>
        <file category="include" name="components/codec/ak4497/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.0.0" condition="driver.clock.condition_id">
      <description>Clock Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXC243/drivers/fsl_clock.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXC243/drivers/fsl_clock.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXC243/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cmp" Cversion="2.0.3" condition="driver.cmp.condition_id">
      <description>CMP Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXC243/drivers/fsl_cmp.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXC243/drivers/fsl_cmp.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXC243/drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="GPIO" Csub="gpio_cmsis" Cversion="1.0.0" Capiversion="1.0.0" condition="driver.cmsis_gpio.condition_id">
      <description>GPIO CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MCXC243/cmsis_drivers/fsl_gpio_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXC243/cmsis_drivers/fsl_gpio_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXC243/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Csub="i2c_cmsis" Cversion="2.2.0" Capiversion="2.3.0" condition="driver.cmsis_i2c.condition_id">
      <description>I2C CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MCXC243/cmsis_drivers/fsl_i2c_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXC243/cmsis_drivers/fsl_i2c_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXC243/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="lpuart_cmsis" Cversion="2.7.0" Capiversion="2.3.0" condition="driver.cmsis_lpuart.condition_id">
      <description>LPUART CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MCXC243/cmsis_drivers/fsl_lpuart_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXC243/cmsis_drivers/fsl_lpuart_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXC243/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="spi_cmsis" Cversion="2.3.0" Capiversion="2.2.0" condition="driver.cmsis_spi.condition_id">
      <description>SPI CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MCXC243/cmsis_drivers/fsl_spi_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXC243/cmsis_drivers/fsl_spi_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXC243/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="uart_cmsis" Cversion="2.2.0" Capiversion="2.3.0" condition="driver.cmsis_uart.condition_id">
      <description>UART CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MCXC243/cmsis_drivers/fsl_uart_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXC243/cmsis_drivers/fsl_uart_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXC243/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="codec" Cversion="2.3.1" condition="driver.codec.condition_id">
      <description>Driver codec</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/codec/fsl_codec_common.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/fsl_codec_common.c" projectpath="codec"/>
        <file category="include" name="components/codec/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.6.0" condition="driver.common.condition_id">
      <description>common Driver</description>
      <files>
        <file category="header" name="devices/MCXC243/drivers/fsl_common.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXC243/drivers/fsl_common.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm0p.condition_id" category="sourceC" name="devices/MCXC243/drivers/fsl_common_arm.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm0p.condition_id" category="header" name="devices/MCXC243/drivers/fsl_common_arm.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXC243/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cop" Cversion="2.0.2" condition="driver.cop.condition_id">
      <description>COP Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXC243/drivers/fsl_cop.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXC243/drivers/fsl_cop.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXC243/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cs42448" Cversion="2.0.1" condition="driver.cs42448.condition_id">
      <description>Driver cs42448</description>
      <RTE_Components_h>
#ifndef CODEC_CS42448_ENABLE
#define CODEC_CS42448_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/cs42448/fsl_cs42448.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/cs42448/fsl_cs42448.c" projectpath="codec"/>
        <file category="include" name="components/codec/cs42448/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888" Cversion="2.1.3" condition="driver.cs42888.condition_id">
      <description>Driver cs42888</description>
      <RTE_Components_h>
#ifndef CODEC_CS42888_ENABLE
#define CODEC_CS42888_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/cs42888/fsl_cs42888.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/cs42888/fsl_cs42888.c" projectpath="codec"/>
        <file category="include" name="components/codec/cs42888/"/>
      </files>
    </component>
