vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXC243_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dac" Cversion="2.0.2" condition="driver.dac.condition_id">
      <description>DAC Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXC243/drivers/fsl_dac.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXC243/drivers/fsl_dac.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXC243/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dialog7212" Cversion="2.3.1" condition="driver.dialog7212.condition_id">
      <description>Driver dialog7212</description>
      <RTE_Components_h>
#ifndef CODEC_DA7212_ENABLE
#define CODEC_DA7212_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/da7212/fsl_dialog7212.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/da7212/fsl_dialog7212.c" projectpath="codec"/>
        <file category="include" name="components/codec/da7212/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dma" Cversion="2.1.2" condition="driver.dma.condition_id">
      <description>DMA Driver</description>
      <files>
        <file category="header" name="devices/MCXC243/drivers/fsl_dma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXC243/drivers/fsl_dma.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXC243/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux" Cversion="2.1.3" condition="driver.dmamux.condition_id">
      <description>DMAMUX Driver</description>
      <files>
        <file category="header" name="devices/MCXC243/drivers/fsl_dmamux.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXC243/drivers/fsl_dmamux.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXC243/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ektf2k" Cversion="1.0.0" condition="driver.ektf2k.condition_id">
      <description>Driver ektf2k</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/touch/ektf2k/fsl_ektf2k.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/touch/ektf2k/fsl_ektf2k.c" projectpath="touchpanel"/>
        <file category="include" name="components/touch/ektf2k/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flash" Cversion="3.3.0" condition="driver.flash.condition_id">
      <description>Flash Driver</description>
      <files>
        <file category="header" name="devices/MCXC243/drivers/fsl_ftfx_adapter.h" projectpath="drivers"/>
        <file category="header" name="devices/MCXC243/drivers/fsl_ftfx_utilities.h" projectpath="drivers"/>
        <file category="header" name="devices/MCXC243/drivers/fsl_ftfx_features.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXC243/drivers/fsl_ftfx_controller.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXC243/drivers/fsl_ftfx_controller.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXC243/drivers/fsl_ftfx_flash.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXC243/drivers/fsl_ftfx_flash.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXC243/drivers/fsl_ftfx_cache.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXC243/drivers/fsl_ftfx_cache.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXC243/drivers/fsl_ftfx_flexnvm.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXC243/drivers/fsl_ftfx_flexnvm.h" projectpath="drivers"/>
        <file category="header" name="devices/MCXC243/drivers/fsl_flash.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXC243/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio" Cversion="2.3.0" condition="driver.flexio.condition_id">
      <description>FLEXIO Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXC243/drivers/fsl_flexio.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXC243/drivers/fsl_flexio.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXC243/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2c_master" Cversion="2.6.2" condition="driver.flexio_i2c_master.condition_id">
      <description>FLEXIO I2C Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXC243/drivers/fsl_flexio_i2c_master.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXC243/drivers/fsl_flexio_i2c_master.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXC243/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2s" Cversion="2.2.1" condition="driver.flexio_i2s.condition_id">
      <description>FLEXIO I2S Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXC243/drivers/fsl_flexio_i2s.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXC243/drivers/fsl_flexio_i2s.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXC243/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2s_dma" Cversion="2.1.7" condition="driver.flexio_i2s_dma.condition_id">
      <description>FLEXIO I2S DMA Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXC243/drivers/fsl_flexio_i2s_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXC243/drivers/fsl_flexio_i2s_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXC243/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi" Cversion="2.4.3" condition="driver.flexio_spi.condition_id">
      <description>FLEXIO SPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXC243/drivers/fsl_flexio_spi.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXC243/drivers/fsl_flexio_spi.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXC243/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi_dma" Cversion="2.3.0" condition="driver.flexio_spi_dma.condition_id">
      <description>FLEXIO SPI DMA Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXC243/drivers/fsl_flexio_spi_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXC243/drivers/fsl_flexio_spi_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXC243/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart" Cversion="2.6.4" condition="driver.flexio_uart.condition_id">
      <description>FLEXIO UART Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXC243/drivers/fsl_flexio_uart.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXC243/drivers/fsl_flexio_uart.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXC243/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart_dma" Cversion="2.4.0" condition="driver.flexio_uart_dma.condition_id">
      <description>FLEXIO UART DMA Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXC243/drivers/fsl_flexio_uart_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXC243/drivers/fsl_flexio_uart_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXC243/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ft3267" Cversion="1.0.1" condition="driver.ft3267.condition_id">
      <description>Touch panel controller FT3267 driver</description>
      <files>
        <file category="header" name="components/touch/ft3267/fsl_ft3267.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/touch/ft3267/fsl_ft3267.c" projectpath="touchpanel"/>
        <file category="include" name="components/touch/ft3267/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ft5406" Cversion="1.0.0" condition="driver.ft5406.condition_id">
      <description>Driver ft5406</description>
      <files>
        <file category="header" name="components/touch/ft5406/fsl_ft5406.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/touch/ft5406/fsl_ft5406.c" projectpath="touchpanel"/>
        <file category="include" name="components/touch/ft5406/"/>
      </files>
    </component>
